espressif/esp-idf/components/soc/esp32p4/include/soc/pwm_struct.h
/**
 * SPDX-FileCopyrightText: 2023 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: clk_cfg */
/** Type of clk_cfg register
 *  PWM clock prescaler register.
 */
typedef union {
    struct {
        /** clk_prescale : R/W; bitpos: [7:0]; default: 0;
         *  Configures the prescaler value of clock, so that the period of PWM_clk = 6.25ns *
         *  (PWM_CLK_PRESCALE + 1).
         */
        uint32_t clk_prescale:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} mcpwm_clk_cfg_reg_t;


/** Group: timer */
/** Type of timern_cfg0 register
 *  PWM timern period and update method configuration register.
 */
typedef union {
    struct {
        /** timer0_prescale : R/W; bitpos: [7:0]; default: 0;
         *  Configures the prescaler value of timern, so that the period of PT0_clk = Period of
         *  PWM_clk * (PWM_TIMERn_PRESCALE + 1)
         */
        uint32_t timer0_prescale:8;
        /** timer0_period : R/W; bitpos: [23:8]; default: 255;
         *  Configures the period shadow of PWM timern
         */
        uint32_t timer0_period:16;
        /** timer0_period_upmethod : R/W; bitpos: [25:24]; default: 0;
         *  Configures the update method for active register of PWM timern period.\\0:
         *  Immediate\\1: TEZ\\2: Sync\\3: TEZ or sync\\TEZ here and below means timer equal
         *  zero event
         */
        uint32_t timer0_period_upmethod:2;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} mcpwm_timer_cfg0_reg_t;

/** Type of timer0_cfg1 register
 *  PWM timer$n working mode and start/stop control register.
 */
typedef union {
    struct {
        /** timer0_start : R/W/SC; bitpos: [2:0]; default: 0;
         *  Configures whether or not to start/stop PWM timer$n.\\0: If PWM timer$n starts,
         *  then stops at TEZ\\1: If timer$n starts, then stops at TEP\\2: PWM timer$n starts
         *  and runs on\\3: Timer$n starts and stops at the next TEZ\\4: Timer0 starts and
         *  stops at the next TEP.\\TEP here and below means the event that happens when the
         *  timer equals to period
         */
        uint32_t timer0_start:3;
        /** timer0_mod : R/W; bitpos: [4:3]; default: 0;
         *  Configures the working mode of PWM timer$n.\\0: Freeze\\1: Increase mode\\2:
         *  Decrease mode\\3: Up-down mode
         */
        uint32_t timer0_mod:2;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} mcpwm_timer_cfg1_reg_t;

/** Type of timer0_sync register
 *  PWM timer$n sync function configuration register.
 */
typedef union {
    struct {
        /** timer0_synci_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable timer$n reloading with phase on sync input
         *  event is enabled.\\0: Disable\\1: Enable
         */
        uint32_t timer0_synci_en:1;
        /** timer0_sync_sw : R/W; bitpos: [1]; default: 0;
         *  Configures the generation of software sync. Toggling this bit will trigger a
         *  software sync.
         */
        uint32_t timer0_sync_sw:1;
        /** timer0_synco_sel : R/W; bitpos: [3:2]; default: 0;
         *  Configures the selection of PWM timer$n sync_out.\\0: Sync_in\\1: TEZ\\2: TEP\\3:
         *  Invalid, sync_out selects noting
         */
        uint32_t timer0_synco_sel:2;
        /** timer0_phase : R/W; bitpos: [19:4]; default: 0;
         *  Configures the phase for timer$n reload on sync event.
         */
        uint32_t timer0_phase:16;
        /** timer0_phase_direction : R/W; bitpos: [20]; default: 0;
         *  Configures the PWM timer$n's direction when timer$n mode is up-down mode.\\0:
         *  Increase\\1: Decrease
         */
        uint32_t timer0_phase_direction:1;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} mcpwm_timer_sync_reg_t;

/** Type of timer0_status register
 *  PWM timer$n status register.
 */
typedef union {
    struct {
        /** timer0_value : RO; bitpos: [15:0]; default: 0;
         *  Represents current PWM timer$n counter value.
         */
        uint32_t timer0_value:16;
        /** timer0_direction : RO; bitpos: [16]; default: 0;
         *  Represents current PWM timer$n counter direction.\\0: Increment\\1: Decrement
         */
        uint32_t timer0_direction:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} mcpwm_timer_status_reg_t;

/** Type of timer1_cfg1 register
 *  PWM timer$n working mode and start/stop control register.
 */
typedef union {
    struct {
        /** timer1_start : R/W/SC; bitpos: [2:0]; default: 0;
         *  Configures whether or not to start/stop PWM timer$n.\\0: If PWM timer$n starts,
         *  then stops at TEZ\\1: If timer$n starts, then stops at TEP\\2: PWM timer$n starts
         *  and runs on\\3: Timer$n starts and stops at the next TEZ\\4: Timer0 starts and
         *  stops at the next TEP.\\TEP here and below means the event that happens when the
         *  timer equals to period
         */
        uint32_t timer1_start:3;
        /** timer1_mod : R/W; bitpos: [4:3]; default: 0;
         *  Configures the working mode of PWM timer$n.\\0: Freeze\\1: Increase mode\\2:
         *  Decrease mode\\3: Up-down mode
         */
        uint32_t timer1_mod:2;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} mcpwm_timer1_cfg1_reg_t;

/** Type of timer1_sync register
 *  PWM timer$n sync function configuration register.
 */
typedef union {
    struct {
        /** timer1_synci_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable timer$n reloading with phase on sync input
         *  event is enabled.\\0: Disable\\1: Enable
         */
        uint32_t timer1_synci_en:1;
        /** timer1_sync_sw : R/W; bitpos: [1]; default: 0;
         *  Configures the generation of software sync. Toggling this bit will trigger a
         *  software sync.
         */
        uint32_t timer1_sync_sw:1;
        /** timer1_synco_sel : R/W; bitpos: [3:2]; default: 0;
         *  Configures the selection of PWM timer$n sync_out.\\0: Sync_in\\1: TEZ\\2: TEP\\3:
         *  Invalid, sync_out selects noting
         */
        uint32_t timer1_synco_sel:2;
        /** timer1_phase : R/W; bitpos: [19:4]; default: 0;
         *  Configures the phase for timer$n reload on sync event.
         */
        uint32_t timer1_phase:16;
        /** timer1_phase_direction : R/W; bitpos: [20]; default: 0;
         *  Configures the PWM timer$n's direction when timer$n mode is up-down mode.\\0:
         *  Increase\\1: Decrease
         */
        uint32_t timer1_phase_direction:1;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} mcpwm_timer1_sync_reg_t;

