espressif/esp-idf/components/soc/esp32p4/include/soc/pwm_struct.h
/** Type of timer1_status register
 *  PWM timer$n status register.
 */
typedef union {
    struct {
        /** timer1_value : RO; bitpos: [15:0]; default: 0;
         *  Represents current PWM timer$n counter value.
         */
        uint32_t timer1_value:16;
        /** timer1_direction : RO; bitpos: [16]; default: 0;
         *  Represents current PWM timer$n counter direction.\\0: Increment\\1: Decrement
         */
        uint32_t timer1_direction:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} mcpwm_timer1_status_reg_t;

/** Type of timer2_cfg1 register
 *  PWM timer$n working mode and start/stop control register.
 */
typedef union {
    struct {
        /** timer2_start : R/W/SC; bitpos: [2:0]; default: 0;
         *  Configures whether or not to start/stop PWM timer$n.\\0: If PWM timer$n starts,
         *  then stops at TEZ\\1: If timer$n starts, then stops at TEP\\2: PWM timer$n starts
         *  and runs on\\3: Timer$n starts and stops at the next TEZ\\4: Timer0 starts and
         *  stops at the next TEP.\\TEP here and below means the event that happens when the
         *  timer equals to period
         */
        uint32_t timer2_start:3;
        /** timer2_mod : R/W; bitpos: [4:3]; default: 0;
         *  Configures the working mode of PWM timer$n.\\0: Freeze\\1: Increase mode\\2:
         *  Decrease mode\\3: Up-down mode
         */
        uint32_t timer2_mod:2;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} mcpwm_timer2_cfg1_reg_t;

/** Type of timer2_sync register
 *  PWM timer$n sync function configuration register.
 */
typedef union {
    struct {
        /** timer2_synci_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable timer$n reloading with phase on sync input
         *  event is enabled.\\0: Disable\\1: Enable
         */
        uint32_t timer2_synci_en:1;
        /** timer2_sync_sw : R/W; bitpos: [1]; default: 0;
         *  Configures the generation of software sync. Toggling this bit will trigger a
         *  software sync.
         */
        uint32_t timer2_sync_sw:1;
        /** timer2_synco_sel : R/W; bitpos: [3:2]; default: 0;
         *  Configures the selection of PWM timer$n sync_out.\\0: Sync_in\\1: TEZ\\2: TEP\\3:
         *  Invalid, sync_out selects noting
         */
        uint32_t timer2_synco_sel:2;
        /** timer2_phase : R/W; bitpos: [19:4]; default: 0;
         *  Configures the phase for timer$n reload on sync event.
         */
        uint32_t timer2_phase:16;
        /** timer2_phase_direction : R/W; bitpos: [20]; default: 0;
         *  Configures the PWM timer$n's direction when timer$n mode is up-down mode.\\0:
         *  Increase\\1: Decrease
         */
        uint32_t timer2_phase_direction:1;
        uint32_t reserved_21:11;
    };
    uint32_t val;
} mcpwm_timer2_sync_reg_t;

/** Type of timer2_status register
 *  PWM timer$n status register.
 */
typedef union {
    struct {
        /** timer2_value : RO; bitpos: [15:0]; default: 0;
         *  Represents current PWM timer$n counter value.
         */
        uint32_t timer2_value:16;
        /** timer2_direction : RO; bitpos: [16]; default: 0;
         *  Represents current PWM timer$n counter direction.\\0: Increment\\1: Decrement
         */
        uint32_t timer2_direction:1;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} mcpwm_timer2_status_reg_t;


/** Group: timer_synci_cfg */
/** Type of timer_synci_cfg register
 *  Synchronization input selection register for PWM timers.
 */
typedef union {
    struct {
        /** timer0_syncisel : R/W; bitpos: [2:0]; default: 0;
         *  Configures the selection of sync input for PWM timer0.\\1: PWM timer0 sync_out\\2:
         *  PWM timer1 sync_out\\3: PWM timer2 sync_out\\4: SYNC0 from GPIO matrix\\5: SYNC1
         *  from GPIO matrix\\6: SYNC2 from GPIO matrix\\Other values: No sync input selected
         */
        uint32_t timer0_syncisel:3;
        /** timer1_syncisel : R/W; bitpos: [5:3]; default: 0;
         *  Configures the selection of sync input for PWM timer1.\\1: PWM timer0 sync_out\\2:
         *  PWM timer1 sync_out\\3: PWM timer2 sync_out\\4: SYNC0 from GPIO matrix\\5: SYNC1
         *  from GPIO matrix\\6: SYNC2 from GPIO matrix\\Other values: No sync input selected
         */
        uint32_t timer1_syncisel:3;
        /** timer2_syncisel : R/W; bitpos: [8:6]; default: 0;
         *  Configures the selection of sync input for PWM timer2.\\1: PWM timer0 sync_out\\2:
         *  PWM timer1 sync_out\\3: PWM timer2 sync_out\\4: SYNC0 from GPIO matrix\\5: SYNC1
         *  from GPIO matrix\\6: SYNC2 from GPIO matrix\\Other values: No sync input selected
         */
        uint32_t timer2_syncisel:3;
        /** external_synci0_invert : R/W; bitpos: [9]; default: 0;
         *  Configures whether or not to invert SYNC0 from GPIO matrix.\\0: Not invert\\1:
         *  Invert
         */
        uint32_t external_synci0_invert:1;
        /** external_synci1_invert : R/W; bitpos: [10]; default: 0;
         *  Configures whether or not to invert SYNC1 from GPIO matrix.\\0: Not invert\\1:
         *  Invert
         */
        uint32_t external_synci1_invert:1;
        /** external_synci2_invert : R/W; bitpos: [11]; default: 0;
         *  Configures whether or not to invert SYNC2 from GPIO matrix.\\0: Not invert\\1:
         *  Invert
         */
        uint32_t external_synci2_invert:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} mcpwm_timer_synci_cfg_reg_t;


/** Group: operator_timersel */
/** Type of operator_timersel register
 *  PWM operator's timer select register
 */
typedef union {
    struct {
        /** operator0_timersel : R/W; bitpos: [1:0]; default: 0;
         *  Configures which PWM timer will be the timing reference for PWM operator0.\\0:
         *  Timer0\\1: Timer1\\2: Timer2\\3: Invalid, will select timer2
         */
        uint32_t operator0_timersel:2;
        /** operator1_timersel : R/W; bitpos: [3:2]; default: 0;
         *  Configures which PWM timer will be the timing reference for PWM operator1.\\0:
         *  Timer0\\1: Timer1\\2: Timer2\\3: Invalid, will select timer2
         */
        uint32_t operator1_timersel:2;
        /** operator2_timersel : R/W; bitpos: [5:4]; default: 0;
         *  Configures which PWM timer will be the timing reference for PWM operator2.\\0:
         *  Timer0\\1: Timer1\\2: Timer2\\3: Invalid, will select timer2
         */
        uint32_t operator2_timersel:2;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} mcpwm_operator_timersel_reg_t;


/** Group: operators */
/** Type of genn_stmp_cfg register
 *  Generatorn time stamp registers A and B transfer status and update method register
 */
typedef union {
    struct {
        /** cmpr0_a_upmethod : R/W; bitpos: [3:0]; default: 0;
         *  Configures the update method for PWM generator n time stamp A's active
         *  register.\\0: Immediately\\Bit0 is set to 1: TEZ\\Bit1 is set to 1: TEP\\Bit2 is
         *  set to 1: Sync\\Bit3 is set to 1: Disable the update
         */
        uint32_t cmpr0_a_upmethod:4;
        /** cmpr0_b_upmethod : R/W; bitpos: [7:4]; default: 0;
         *  Configures the update method for PWM generator n time stamp B's active
         *  register.\\0: Immediately\\Bit0 is set to 1: TEZ\\Bit1 is set to 1: TEP\\Bit2 is
         *  set to 1: Sync\\Bit3 is set to 1: Disable the update
         */
        uint32_t cmpr0_b_upmethod:4;
        /** cmpr0_a_shdw_full : R/W/WTC/SC; bitpos: [8]; default: 0;
         *  Represents whether or not generatorn time stamp A's shadow reg is transferred.\\0:
         *  A's active reg has been updated with shadow register latest value.\\1: A's shadow
         *  reg is filled and waiting to be transferred to A's active reg
         */
        uint32_t cmpr0_a_shdw_full:1;
        /** cmpr0_b_shdw_full : R/W/WTC/SC; bitpos: [9]; default: 0;
         *  Represents whether or not generatorn time stamp B's shadow reg is transferred.\\0:
         *  B's active reg has been updated with shadow register latest value.\\1: B's shadow
         *  reg is filled and waiting to be transferred to B's active reg
         */
        uint32_t cmpr0_b_shdw_full:1;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} mcpwm_gen_stmp_cfg_reg_t;

/** Type of gen0_tstmp_a register
 *  Generator$n time stamp A's shadow register
 */
typedef union {
    struct {
        /** cmpr0_a : R/W; bitpos: [15:0]; default: 0;
         *  Configures the value of PWM generator $n time stamp A's shadow register.
         */
        uint32_t cmpr0_a:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_gen_tstmp_a_reg_t;

/** Type of gen0_tstmp_b register
 *  Generator$n time stamp B's shadow register
 */
typedef union {
    struct {
        /** cmpr0_b : R/W; bitpos: [15:0]; default: 0;
         *  Configures the value of PWM generator $n time stamp B's shadow register.
         */
        uint32_t cmpr0_b:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_gen_tstmp_b_reg_t;

/** Type of gen0_cfg0 register
 *  Generator$n fault event T0 and T1 configuration register
 */
typedef union {
    struct {
        /** gen0_cfg_upmethod : R/W; bitpos: [3:0]; default: 0;
         *  Configures update method for PWM generator $n's active register.\\0:
         *  Immediately\\Bit0 is set to 1: TEZ\\Bit1 is set to 1: TEP\\Bit2 is set to 1:
         *  Sync\\Bit3 is set to 1: Disable the update
         */
        uint32_t gen0_cfg_upmethod:4;
        /** gen0_t0_sel : R/W; bitpos: [6:4]; default: 0;
         *  Configures source selection for PWM generator $n event_t0, take effect
         *  immediately.\\0: fault_event0\\1: fault_event1\\2: fault_event2\\3: sync_taken\\4:
         *  Invalid, Select nothing
         */
        uint32_t gen0_t0_sel:3;
        /** gen0_t1_sel : R/W; bitpos: [9:7]; default: 0;
         *  Configures source selection for PWM generator $n event_t1, take effect
         *  immediately.\\0: fault_event0\\1: fault_event1\\2: fault_event2\\3: sync_taken\\4:
         *  Invalid, Select nothing
         */
        uint32_t gen0_t1_sel:3;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} mcpwm_gen_cfg0_reg_t;

/** Type of gen0_force register
 *  Generator$n output signal force mode register.
 */
typedef union {
    struct {
        /** gen0_cntuforce_upmethod : R/W; bitpos: [5:0]; default: 32;
         *  Configures update method for continuous software force of PWM generator$n.\\0:
         *  Immediately\\Bit0 is set to 1: TEZ\\Bit1 is set to 1: TEP\\Bit2 is set to 1:
         *  TEA\\Bit3 is set to 1: TEB\\Bit4 is set to 1: Sync\\Bit5 is set to 1: Disable
         *  update. TEA/B here and below means an event generated when the timer's value equals
         *  to that of register A/B.
         */
        uint32_t gen0_cntuforce_upmethod:6;
        /** gen0_a_cntuforce_mode : R/W; bitpos: [7:6]; default: 0;
         *  Configures continuous software force mode for PWM$n A.\\0: Disabled\\1: Low\\2:
         *  High\\3: Disabled
         */
        uint32_t gen0_a_cntuforce_mode:2;
        /** gen0_b_cntuforce_mode : R/W; bitpos: [9:8]; default: 0;
         *  Configures continuous software force mode for PWM$n B.\\0: Disabled\\1: Low\\2:
         *  High\\3: Disabled
         */
        uint32_t gen0_b_cntuforce_mode:2;
        /** gen0_a_nciforce : R/W; bitpos: [10]; default: 0;
         *  Configures the generation of non-continuous immediate software-force event for
         *  PWM$n A, a toggle will trigger a force event.
         */
        uint32_t gen0_a_nciforce:1;
        /** gen0_a_nciforce_mode : R/W; bitpos: [12:11]; default: 0;
         *  Configures non-continuous immediate software force mode for PWM$n A.\\0:
         *  Disabled\\1: Low\\2: High\\3: Disabled
         */
        uint32_t gen0_a_nciforce_mode:2;
        /** gen0_b_nciforce : R/W; bitpos: [13]; default: 0;
         *  Configures the generation of non-continuous immediate software-force event for
         *  PWM$n B, a toggle will trigger a force event.
         */
        uint32_t gen0_b_nciforce:1;
        /** gen0_b_nciforce_mode : R/W; bitpos: [15:14]; default: 0;
         *  Configures non-continuous immediate software force mode for PWM$n B.\\0:
         *  Disabled\\1: Low\\2: High\\3: Disabled
         */
        uint32_t gen0_b_nciforce_mode:2;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_gen_force_reg_t;

