espressif/esp-idf/components/soc/esp32p4/include/soc/pwm_struct.h
/** Type of gen0_a register
 *  PWM$n output signal A actions configuration register
 */
typedef union {
    struct {
        /** gen0_a_utez : R/W; bitpos: [1:0]; default: 0;
         *  Configures action on PWM$n A triggered by event TEZ when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen0_a_utez:2;
        /** gen0_a_utep : R/W; bitpos: [3:2]; default: 0;
         *  Configures action on PWM$n A triggered by event TEP when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen0_a_utep:2;
        /** gen0_a_utea : R/W; bitpos: [5:4]; default: 0;
         *  Configures action on PWM$n A triggered by event TEA when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen0_a_utea:2;
        /** gen0_a_uteb : R/W; bitpos: [7:6]; default: 0;
         *  Configures action on PWM$n A triggered by event TEB when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen0_a_uteb:2;
        /** gen0_a_ut0 : R/W; bitpos: [9:8]; default: 0;
         *  Configures action on PWM$n A triggered by event_t0 when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen0_a_ut0:2;
        /** gen0_a_ut1 : R/W; bitpos: [11:10]; default: 0;
         *  Configures action on PWM$n A triggered by event_t1 when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen0_a_ut1:2;
        /** gen0_a_dtez : R/W; bitpos: [13:12]; default: 0;
         *  Configures action on PWM$n A triggered by event TEZ when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen0_a_dtez:2;
        /** gen0_a_dtep : R/W; bitpos: [15:14]; default: 0;
         *  Configures action on PWM$n A triggered by event TEP when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen0_a_dtep:2;
        /** gen0_a_dtea : R/W; bitpos: [17:16]; default: 0;
         *  Configures action on PWM$n A triggered by event TEA when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen0_a_dtea:2;
        /** gen0_a_dteb : R/W; bitpos: [19:18]; default: 0;
         *  Configures action on PWM$n A triggered by event TEB when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen0_a_dteb:2;
        /** gen0_a_dt0 : R/W; bitpos: [21:20]; default: 0;
         *  Configures action on PWM$n A triggered by event_t0 when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen0_a_dt0:2;
        /** gen0_a_dt1 : R/W; bitpos: [23:22]; default: 0;
         *  Configures action on PWM$n A triggered by event_t1 when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen0_a_dt1:2;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} mcpwm_gen_a_reg_t;

/** Type of gen0_b register
 *  PWM$n output signal B actions configuration register
 */
typedef union {
    struct {
        /** gen0_b_utez : R/W; bitpos: [1:0]; default: 0;
         *  Configures action on PWM$n B triggered by event TEZ when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen0_b_utez:2;
        /** gen0_b_utep : R/W; bitpos: [3:2]; default: 0;
         *  Configures action on PWM$n B triggered by event TEP when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen0_b_utep:2;
        /** gen0_b_utea : R/W; bitpos: [5:4]; default: 0;
         *  Configures action on PWM$n B triggered by event TEA when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen0_b_utea:2;
        /** gen0_b_uteb : R/W; bitpos: [7:6]; default: 0;
         *  Configures action on PWM$n B triggered by event TEB when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen0_b_uteb:2;
        /** gen0_b_ut0 : R/W; bitpos: [9:8]; default: 0;
         *  Configures action on PWM$n B triggered by event_t0 when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen0_b_ut0:2;
        /** gen0_b_ut1 : R/W; bitpos: [11:10]; default: 0;
         *  Configures action on PWM$n B triggered by event_t1 when timer increasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen0_b_ut1:2;
        /** gen0_b_dtez : R/W; bitpos: [13:12]; default: 0;
         *  Configures action on PWM$n B triggered by event TEZ when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen0_b_dtez:2;
        /** gen0_b_dtep : R/W; bitpos: [15:14]; default: 0;
         *  Configures action on PWM$n B triggered by event TEP when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen0_b_dtep:2;
        /** gen0_b_dtea : R/W; bitpos: [17:16]; default: 0;
         *  Configures action on PWM$n B triggered by event TEA when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen0_b_dtea:2;
        /** gen0_b_dteb : R/W; bitpos: [19:18]; default: 0;
         *  Configures action on PWM$n B triggered by event TEB when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen0_b_dteb:2;
        /** gen0_b_dt0 : R/W; bitpos: [21:20]; default: 0;
         *  Configures action on PWM$n B triggered by event_t0 when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen0_b_dt0:2;
        /** gen0_b_dt1 : R/W; bitpos: [23:22]; default: 0;
         *  Configures action on PWM$n B triggered by event_t1 when timer decreasing.\\0: No
         *  change\\1: Low\\2: High\\3: Toggle
         */
        uint32_t gen0_b_dt1:2;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} mcpwm_gen_b_reg_t;

/** Type of dt0_cfg register
 *  Dead time configuration register
 */
typedef union {
    struct {
        /** db0_fed_upmethod : R/W; bitpos: [3:0]; default: 0;
         *  Configures update method for FED (Falling edge delay) active register.\\0:
         *  Immediate\\Bit0 is set to 1: TEZ\\Bit1 is set to 1: TEP\\Bit2 is set to 1:
         *  Sync\\Bit3 is set to 1: Disable the update
         */
        uint32_t db0_fed_upmethod:4;
        /** db0_red_upmethod : R/W; bitpos: [7:4]; default: 0;
         *  Configures update method for RED (rising edge delay) active register.\\0:
         *  Immediate\\Bit0 is set to 1: TEZ\\Bit1 is set to 1: TEP\\Bit2 is set to 1:
         *  Sync\\Bit3 is set to 1: Disable the update
         */
        uint32_t db0_red_upmethod:4;
        /** db0_deb_mode : R/W; bitpos: [8]; default: 0;
         *  Configures S8 in table, dual-edge B mode.\\0: fed/red take effect on different path
         *  separately\\1: fed/red take effect on B path, A out is in bypass or dulpB mode
         */
        uint32_t db0_deb_mode:1;
        /** db0_a_outswap : R/W; bitpos: [9]; default: 0;
         *  Configures S6 in table.
         */
        uint32_t db0_a_outswap:1;
        /** db0_b_outswap : R/W; bitpos: [10]; default: 0;
         *  Configures S7 in table.
         */
        uint32_t db0_b_outswap:1;
        /** db0_red_insel : R/W; bitpos: [11]; default: 0;
         *  Configures S4 in table.
         */
        uint32_t db0_red_insel:1;
        /** db0_fed_insel : R/W; bitpos: [12]; default: 0;
         *  Configures S5 in table.
         */
        uint32_t db0_fed_insel:1;
        /** db0_red_outinvert : R/W; bitpos: [13]; default: 0;
         *  Configures S2 in table.
         */
        uint32_t db0_red_outinvert:1;
        /** db0_fed_outinvert : R/W; bitpos: [14]; default: 0;
         *  Configures S3 in table.
         */
        uint32_t db0_fed_outinvert:1;
        /** db0_a_outbypass : R/W; bitpos: [15]; default: 1;
         *  Configures S1 in table.
         */
        uint32_t db0_a_outbypass:1;
        /** db0_b_outbypass : R/W; bitpos: [16]; default: 1;
         *  Configures S0 in table.
         */
        uint32_t db0_b_outbypass:1;
        /** db0_clk_sel : R/W; bitpos: [17]; default: 0;
         *  Configures dead time generator $n clock selection.\\0: PWM_clk\\1: PT_clk
         */
        uint32_t db0_clk_sel:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} mcpwm_dt_cfg_reg_t;

/** Type of dt0_fed_cfg register
 *  Falling edge delay (FED) shadow register
 */
typedef union {
    struct {
        /** db0_fed : R/W; bitpos: [15:0]; default: 0;
         *  Configures shadow register for FED.
         */
        uint32_t db0_fed:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_dt_fed_cfg_reg_t;

/** Type of dt0_red_cfg register
 *  Rising edge delay (RED) shadow register
 */
typedef union {
    struct {
        /** db0_red : R/W; bitpos: [15:0]; default: 0;
         *  Configures shadow register for RED.
         */
        uint32_t db0_red:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_dt_red_cfg_reg_t;

/** Type of carrier0_cfg register
 *  Carrier$n configuration register
 */
typedef union {
    struct {
        /** chopper0_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable carrier$n.\\0: Bypassed\\1: Enabled
         */
        uint32_t chopper0_en:1;
        /** chopper0_prescale : R/W; bitpos: [4:1]; default: 0;
         *  Configures the prescale value of PWM carrier$n clock (PC_clk), so that period of
         *  PC_clk = period of PWM_clk * (PWM_CARRIER$n_PRESCALE + 1)
         */
        uint32_t chopper0_prescale:4;
        /** chopper0_duty : R/W; bitpos: [7:5]; default: 0;
         *  Configures carrier duty. Duty = PWM_CARRIER$n_DUTY / 8
         */
        uint32_t chopper0_duty:3;
        /** chopper0_oshtwth : R/W; bitpos: [11:8]; default: 0;
         *  Configures width of the first pulse. Measurement unit: Periods of the carrier.
         */
        uint32_t chopper0_oshtwth:4;
        /** chopper0_out_invert : R/W; bitpos: [12]; default: 0;
         *  Configures whether or not to invert the output of PWM$n A and PWM$n B for this
         *  submodule.\\0: Normal\\1: Invert
         */
        uint32_t chopper0_out_invert:1;
        /** chopper0_in_invert : R/W; bitpos: [13]; default: 0;
         *  Configures whether or not to invert the input of PWM$n A and PWM$n B for this
         *  submodule.\\0: Normal\\1: Invert
         */
        uint32_t chopper0_in_invert:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} mcpwm_carrier_cfg_reg_t;

/** Type of fh0_cfg0 register
 *  PWM$n A and PWM$n B trip events actions configuration register
 */
typedef union {
    struct {
        /** tz0_sw_cbc : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable software force cycle-by-cycle mode action.\\0:
         *  Disable\\1: Enable
         */
        uint32_t tz0_sw_cbc:1;
        /** tz0_f2_cbc : R/W; bitpos: [1]; default: 0;
         *  Configures whether or not event_f2 will trigger cycle-by-cycle mode action.\\0:
         *  Disable\\1: Enable
         */
        uint32_t tz0_f2_cbc:1;
        /** tz0_f1_cbc : R/W; bitpos: [2]; default: 0;
         *  Configures whether or not event_f1 will trigger cycle-by-cycle mode action.\\0:
         *  Disable\\1: Enable
         */
        uint32_t tz0_f1_cbc:1;
        /** tz0_f0_cbc : R/W; bitpos: [3]; default: 0;
         *  Configures whether or not event_f0 will trigger cycle-by-cycle mode action.\\0:
         *  Disable\\1: Enable
         */
        uint32_t tz0_f0_cbc:1;
        /** tz0_sw_ost : R/W; bitpos: [4]; default: 0;
         *  Configures whether or not to enable software force one-shot mode action.\\0:
         *  Disable\\1: Enable
         */
        uint32_t tz0_sw_ost:1;
        /** tz0_f2_ost : R/W; bitpos: [5]; default: 0;
         *  Configures whether or not event_f2 will trigger one-shot mode action.\\0:
         *  Disable\\1: Enable
         */
        uint32_t tz0_f2_ost:1;
        /** tz0_f1_ost : R/W; bitpos: [6]; default: 0;
         *  Configures whether or not event_f1 will trigger one-shot mode action.\\0:
         *  Disable\\1: Enable
         */
        uint32_t tz0_f1_ost:1;
        /** tz0_f0_ost : R/W; bitpos: [7]; default: 0;
         *  Configures whether or not event_f0 will trigger one-shot mode action.\\0:
         *  Disable\\1: Enable
         */
        uint32_t tz0_f0_ost:1;
        /** tz0_a_cbc_d : R/W; bitpos: [9:8]; default: 0;
         *  Configures cycle-by-cycle mode action on PWM$n A when fault event occurs and timer
         *  is decreasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle
         */
        uint32_t tz0_a_cbc_d:2;
        /** tz0_a_cbc_u : R/W; bitpos: [11:10]; default: 0;
         *  Configures cycle-by-cycle mode action on PWM$n A when fault event occurs and timer
         *  is increasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle
         */
        uint32_t tz0_a_cbc_u:2;
        /** tz0_a_ost_d : R/W; bitpos: [13:12]; default: 0;
         *  Configures one-shot mode action on PWM$n A when fault event occurs and timer is
         *  decreasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle
         */
        uint32_t tz0_a_ost_d:2;
        /** tz0_a_ost_u : R/W; bitpos: [15:14]; default: 0;
         *  Configures one-shot mode action on PWM$n A when fault event occurs and timer is
         *  increasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle
         */
        uint32_t tz0_a_ost_u:2;
        /** tz0_b_cbc_d : R/W; bitpos: [17:16]; default: 0;
         *  Configures cycle-by-cycle mode action on PWM$n B when fault event occurs and timer
         *  is decreasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle
         */
        uint32_t tz0_b_cbc_d:2;
        /** tz0_b_cbc_u : R/W; bitpos: [19:18]; default: 0;
         *  Configures cycle-by-cycle mode action on PWM$n B when fault event occurs and timer
         *  is increasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle
         */
        uint32_t tz0_b_cbc_u:2;
        /** tz0_b_ost_d : R/W; bitpos: [21:20]; default: 0;
         *  Configures one-shot mode action on PWM$n B when fault event occurs and timer is
         *  decreasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle
         */
        uint32_t tz0_b_ost_d:2;
        /** tz0_b_ost_u : R/W; bitpos: [23:22]; default: 0;
         *  Configures one-shot mode action on PWM$n B when fault event occurs and timer is
         *  increasing.\\0: Do nothing\\1: Force low\\2: Force high\\3: Toggle
         */
        uint32_t tz0_b_ost_u:2;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} mcpwm_fh_cfg0_reg_t;

