espressif/esp-idf/components/soc/esp32p4/include/soc/pwm_struct.h
/** Group: evt_en2 */
/** Type of evt_en2 register
 *  Event enable register2
 */
typedef union {
    struct {
        /** evt_op0_tee1_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to enable PWM generator0 timer equal OP0_TSTMP_E1_REG
         *  event generate.\\0: Disable\\1: Enable
         */
        uint32_t evt_op0_tee1_en:1;
        /** evt_op1_tee1_en : R/W; bitpos: [1]; default: 0;
         *  Configures whether or not to enable PWM generator1 timer equal OP1_TSTMP_E1_REG
         *  event generate.\\0: Disable\\1: Enable
         */
        uint32_t evt_op1_tee1_en:1;
        /** evt_op2_tee1_en : R/W; bitpos: [2]; default: 0;
         *  Configures whether or not to enable PWM generator2 timer equal OP2_TSTMP_E1_REG
         *  event generate.\\0: Disable\\1: Enable
         */
        uint32_t evt_op2_tee1_en:1;
        /** evt_op0_tee2_en : R/W; bitpos: [3]; default: 0;
         *  Configures whether or not to enable PWM generator0 timer equal OP0_TSTMP_E2_REG
         *  event generate.\\0: Disable\\1: Enable
         */
        uint32_t evt_op0_tee2_en:1;
        /** evt_op1_tee2_en : R/W; bitpos: [4]; default: 0;
         *  Configures whether or not to enable PWM generator1 timer equal OP1_TSTMP_E2_REG
         *  event generate.\\0: Disable\\1: Enable
         */
        uint32_t evt_op1_tee2_en:1;
        /** evt_op2_tee2_en : R/W; bitpos: [5]; default: 0;
         *  Configures whether or not to enable PWM generator2 timer equal OP2_TSTMP_E2_REG
         *  event generate.\\0: Disable\\1: Enable
         */
        uint32_t evt_op2_tee2_en:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} mcpwm_evt_en2_reg_t;


/** Group: Configuration register */
/** Type of opn_tstmp_e1 register
 *  Generatorn timer stamp E1 value register
 */
typedef union {
    struct {
        /** op0_tstmp_e1 : R/W; bitpos: [15:0]; default: 0;
         *  Configures generatorn timer stamp E1 value register
         */
        uint32_t op0_tstmp_e1:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_op_tstmp_e1_reg_t;

/** Type of op0_tstmp_e2 register
 *  Generator$n timer stamp E2 value register
 */
typedef union {
    struct {
        /** op0_tstmp_e2 : R/W; bitpos: [15:0]; default: 0;
         *  Configures generator$n timer stamp E2 value register
         */
        uint32_t op0_tstmp_e2:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_op_tstmp_e2_reg_t;

/** Type of clk register
 *  Global configuration register
 */
typedef union {
    struct {
        /** clk_en : R/W; bitpos: [0]; default: 0;
         *  Configures whether or not to open register clock gate.\\0: Open the clock gate only
         *  when application writes registers\\1: Force open the clock gate for register
         */
        uint32_t clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} mcpwm_clk_reg_t;


/** Group: Version register */
/** Type of version register
 *  Version register.
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [27:0]; default: 35725968;
         *  Configures the version.
         */
        uint32_t date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} mcpwm_version_reg_t;

typedef struct {
    volatile mcpwm_timer_cfg0_reg_t cfg0;
    volatile mcpwm_timer_cfg1_reg_t cfg1;
    volatile mcpwm_timer_sync_reg_t sync;
    volatile mcpwm_timer_status_reg_t status;
} mcpwm_timer_regs_t;

typedef struct {
    volatile mcpwm_gen_stmp_cfg_reg_t gen_stmp_cfg;
    volatile mcpwm_gen_tstmp_a_reg_t gen_tstmp_a;
    volatile mcpwm_gen_tstmp_b_reg_t gen_tstmp_b;
    volatile mcpwm_gen_cfg0_reg_t gen_cfg0;
    volatile mcpwm_gen_force_reg_t gen_force;
    volatile mcpwm_gen_a_reg_t gen_a;
    volatile mcpwm_gen_b_reg_t gen_b;
    volatile mcpwm_dt_cfg_reg_t dt_cfg;
    volatile mcpwm_dt_fed_cfg_reg_t dt_fed_cfg;
    volatile mcpwm_dt_red_cfg_reg_t dt_red_cfg;
    volatile mcpwm_carrier_cfg_reg_t carrier_cfg;
    volatile mcpwm_fh_cfg0_reg_t fh_cfg0;
    volatile mcpwm_fh_cfg1_reg_t fh_cfg1;
    volatile mcpwm_fh_status_reg_t fh_status;
} mcpwm_operator_reg_t;

typedef struct {
    volatile mcpwm_op_tstmp_e1_reg_t tstmp_e1;
    volatile mcpwm_op_tstmp_e2_reg_t tstmp_e2;
} mcpwm_operator_tstmp_reg_t;

typedef struct {
    volatile mcpwm_clk_cfg_reg_t clk_cfg;
    volatile mcpwm_timer_regs_t timer[3];
    volatile mcpwm_timer_synci_cfg_reg_t timer_synci_cfg;
    volatile mcpwm_operator_timersel_reg_t operator_timersel;
    volatile mcpwm_operator_reg_t operators[3];
    volatile mcpwm_fault_detect_reg_t fault_detect;
    volatile mcpwm_cap_timer_cfg_reg_t cap_timer_cfg;
    volatile mcpwm_cap_timer_phase_reg_t cap_timer_phase;
    volatile mcpwm_cap_chn_cfg_reg_t cap_chn_cfg[3];
    volatile mcpwm_cap_chn_reg_t cap_chn[3];
    volatile mcpwm_cap_status_reg_t cap_status;
    volatile mcpwm_update_cfg_reg_t update_cfg;
    volatile mcpwm_int_ena_reg_t int_ena;
    volatile mcpwm_int_raw_reg_t int_raw;
    volatile mcpwm_int_st_reg_t int_st;
    volatile mcpwm_int_clr_reg_t int_clr;
    volatile mcpwm_evt_en_reg_t evt_en;
    volatile mcpwm_task_en_reg_t task_en;
    volatile mcpwm_evt_en2_reg_t evt_en2;
    volatile mcpwm_operator_tstmp_reg_t op_tstmp[3];
    volatile mcpwm_clk_reg_t clk;
    volatile mcpwm_version_reg_t version;
} mcpwm_dev_t;


#ifndef __cplusplus
_Static_assert(sizeof(mcpwm_dev_t) == 0x14c, "Invalid size of mcpwm_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
